app/views/school_classes/index.html.erb

<h1>School Class Number</h1>
<% SchoolClass.all.each do |school_class| %>
---
SELECT "school_classes".* FROM "school_classes"